In [55]:
#importing libraries
import os
import psycopg2 as ps
import pandas as pd
import sqlite3

In [56]:
#dataframe for data
df=pd.DataFrame({'name': ['Afghanistan','Albania','Algeria','Andorra','Angola'],
               'continent': ['Asia','Europe','Africa','Europe','Africa'],
               'area': [223344, 3333334, 66666666666, 78889999999, 67968968066],
               'population': [2223, 5666, 77788, 8999, 45676],
               'gdp': [66666666, 88999999, 666666, 44455,3334444555]})
df

          name continent         area  population         gdp
0  Afghanistan      Asia       223344        2223    66666666
1      Albania    Europe      3333334        5666    88999999
2      Algeria    Africa  66666666666       77788      666666
3      Andorra    Europe  78889999999        8999       44455
4       Angola    Africa  67968968066       45676  3334444555

- Installing libraries
ipython-sql`, `sqlalchemy
!pip install mysql-connector-python.
psycopg2, sqlite3----done

col_names=["Country","Region","Population","Area (sq. mi.)","Pop. Density (per sq. mi.)","Coastline (coast/area ratio)","Net migration","Infant mortality (per 1000 births)","GDP ($ per capita)","Literacy (%)","Phones (per 1000)","Arable (%)","Crops (%)","Other (%)","Climate","Birthrate"
,"Deathrate","Agriculture","Industry","Service"]
d= pd.read_csv('D:\Kagg\Book1.csv', names= col_names)  #https://medium.com/@sujathamudadla1213/how-to-read-different-types-of-files-in-pandas-f43ceeae6cf0
d

In [57]:
cn=sqlite3.connect('demo.db')

In [72]:
df.to_sql('wor',cn)

5

In [73]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [95]:
%%sql
SELECT* FROM wor

 * sqlite:///demo.db
Done.

[(0, 'Afghanistan', 'Asia', 223344, 2223, 66666666),
 (1, 'Albania', 'Europe', 3333334, 5666, 88999999),
 (2, 'Algeria', 'Africa', 66666666666, 77788, 666666),
 (3, 'Andorra', 'Europe', 78889999999, 8999, 44455),
 (4, 'Angola', 'Africa', 67968968066, 45676, 3334444555)]

# ABS
ABS returns the absolute value. The output is positive even if the input is negative:

ABS(x) = x if x>=0
 ABS(x) = -x if x<0
 ABS can be useful for testing values that are "close".

In [106]:
%%sql
SELECT name, area FROM wor
 WHERE ABS(area-223000)>344

 * sqlite:///demo.db
Done.

[('Albania', 3333334),
 ('Algeria', 66666666666),
 ('Andorra', 78889999999),
 ('Angola', 67968968066)]

In [ ]:
#pip install mysql-connector-python--done

conn = ps.connect(
    host=os.environ["db_host"],
    port=os.environ["db_port"],
    dbname=os.environ["db_name"],
    user=os.environ["db_user"],
    password=os.environ["db_password"])

Structured Query Language or SQL is a standard database language that is used to create, maintain, destroy, update, and retrieve data from relational databases like MySQL, Oracle, SQL Server, PostgreSQL, etc

#Creating Database:
       1.CREATE DATABASE ---dbname--; SHOW DATABASES;

#Creating Tables and adding data:
       2. CREATE TABLE --NAME--(
        -
        -
        -
        );
        #Adding data
        INSERT INTO NAME(Columns name) VALUES(each column value);     for first row........
        2nd
        3rd
        
        #Initiate
        SELECT *FROM NAME;
        GO

SELECT Clause: Retrieve or fetch data from a database.

FROM Clause: From which table in the database do you have to select data?

WHERE Clause: It forms the condition based on which data have to be queried.

DELETE Statement: For deletion tasks.

INSERT INTO: For insertion tasks.

AND and OR operator: Selecting data based on AND or operator.

Drop and Truncate: It will drop or truncate the collection as per the condition.

NOT Operator: It will select the data which is not based on the given condition.

Day 7 to Day 12
From Day 7 to Day 12, you'll take a step forward and learn some advanced concepts like nested queries, wildcard operators, and other clauses.

WITH Clause:  Understand the concept of With clause and use it to name the subquery block.
FETCH clause:  The filtered data is retrieved based on certain conditions, such as only the top three rows.
Arithmetic operators:  Use arithmetic operators to filter the data conveniently and precisely.
Wildcard operators:  To intelligently select exact data such as names that start or end with T.
UPDATE statement:   Update specific data entries based on the provided condition.
ALTER table:  Add, delete or alter the table based on the specified condition.
LIKE clause:  It follows the pattern specified in the search condition.
BETWEEN and IN operator:   It selects the data range  between  or  in  the specified condition.
CASE statement:  Conditions are searched for and the data is queried according to the respective case.
EXISTS:  The nested query is created to filter out the data that exists in another query.
    
Day 13 to Day 18
From day 13 to day 18 you will mainly learn the aggregate functions in SQL.

DISTINCT clause:  Only the different data is selected, not repeating data.
Count function:  Returns the total number of filtered data.
Sum function:  Returns the sum of all queried data.
Average function:  Returns the average of all queried data.
Minimal function:  It returns the minimum data of all queried data.
Maximum function:  It returns the maximum data of all queried data.
ORDER BY:  This statement arranges the queried data in ascending or descending order according to your wishes.
GROUP BY:  This statement groups all your queried data with the column specified in the condition.
ALL and ANY clause:  They are logical operators in SQL and return Boolean values ​​as a result.
TOP clause:  Used to retrieve the limited number of rows from a database.
    
Day 19 to Day 24
From day 19 to day 24, you will learn and practice joins in SQL. It is one of the most important concepts of SQL. 

Union Clause : Just like the mathematical union operator, this clause performs the union of the specified tables.
Intersection clause:  It connects the two or more tables where they intersect.
Aliases : An alias is assigned to the table which we can refer to later.
Cartesian Join and Self Join:  To query some data, sometimes we need to join the table itself with itself.
Inner, left, right and full join:  These four types of joins come into play when we need to join one table to another. Check out their syntax and learn how to handle these joins.
Division Clause:  Division is usually required when you want to find entities that interact with all entities of a set of different entity types.
Using clause:  When multiple columns have the same names but the data types do not match, the NATURAL JOIN clause can be modified with the USING clause to specify the columns to use for an EQUIJOIN.
Combining Values:  Combining aggregated and non-aggregated values ​​in SQL using the Joins and  Over  clause.
MINUS operator:  It is used as “except”, which means it joins the two overlapping tables and minus one table so that only the overlap and the other table are covered.
Joining 3 or more tables:  Although very rarely used, this will help you learn and understand how to join 3 or more tables and then perform the query operations.

Day 25 to Day 30
Others:  As we have covered almost all the topics, now let us come to some of the different topics, concepts and functions. These are important parts of DBMS and SQL and will surely help you in your college exams and competitive exams like GATE CS.